Repository: sabikrahat/bangla_handwritten_math_solver_flutter_app
Catalog: lib/src/localization/app_*.arb
Languages: bn

# appTitle
source: Bangla handwritten math solver
bn: বাংলা হ্যান্ডরিটেন মেট প্রব্লেম

# language
source: English
bn: বাংলা

source: Settings
bn: সেটিংস

source: We are Under Maintenance
bn: আমরা রক্ষণাবেক্ষণ আওতাধীন

source: We will be back soon!
bn: আমরা শীঘ্রই ফিরে আসবো!

source: Contact with Admin
bn: অ্যাডমিনের সাথে যোগাযোগ করুন।

source: Choose an option
bn: একটি নির্বাচন করুন

source: Capture image with camera
bn: ক্যামেরা দিয়ে ছবি তুলুন

source: Select image from gallery
bn: গ্যালারি থেকে ছবি নির্বাচন করুন

source: Cancel
bn: বাতিল

# projectName
source: Smart Teaching Assistant for Mathematics
bn: স্মার্ট টিচিং এসিস্টেন্ট ফর ম্যাটমেটিক্স

source: Supervisor
bn: সুপারভাইজার

# supervisorName
source: Mohammad Salah Uddin
bn: মোঃ সালাহ উদ্দিন

# student1Name
source: Md. Sabik Alam Rahat
bn: মোঃ সাবিক আলম রাহাত

# student2Name
source: Zannaatul Mawa
bn: জান্নাতুল মাওয়া

# student3Name
source: Humaira Tabassum
bn: হুমায়রা তাবাসসুম

# student4Name
source: Md. Abid Hasan Rafe
bn: মোঃ আবিদ হাসান রাফি

source: Start Drawing
bn: ড্রয়িং শুরু করুন

# drawYourMathematicalTermHere
source: Draw your mathematical term here...ðŸ‘†ðŸ‘‡
bn: আপনার গণিতিক টার্ম এখানে আঁকুন...👆👇

source: Drawing Tools
bn: ড্রয়িং টুলস

source: Tools
bn: টুলস

source: Colors
bn: রং

source: Size
bn: সাইজ

source: Stroke Size:
bn: স্ট্রোক সাইজ:

source: Eraser
bn: ইরেসার

source: Clear
bn: মুছুন

source: Pencil
bn: পেন্সিল

source: Eraser Size:
bn: ইরেসার সাইজ:

source: Show on Github
bn: গিটহাবে দেখুন

source: Check
bn: চেক করুন

source: Actions
bn: একশনস

# correct
source: Congratulations! You have drawn the correct mathematical term. Point added to your score.
bn: অভিনন্দন! আপনার উত্তরটি সঠিক হয়েছে। আপনি সঠিক উত্তর দিয়ে একটি পয়েন্ট জিতেছেন।

# wrong
source: Sorry! You have drawn the wrong mathematical term. Better Luck next time. Correct answer is
bn: দুঃখিত! আপনার উত্তরটি ভুল হয়েছে। আপনি ভুল উত্তর দিয়ে একটি পয়েন্ট হেরেছেন। সঠিক উত্তরটি হচ্ছে

source: Next
bn: পরবর্তী

source: Score:
bn: স্কোর:

source: Reset
bn: রিসেট

source: Contribute Data
bn: ডাটা প্রদানে অংশগ্রহণ

# equationPart
source: Write your equation's part here
bn: আপনার সমীকরণের অংশটি এখানে লিখুন

# answerPart
source: Write your answer's part here
bn: আপনার উত্তরের অংশটি এখানে লিখুন

# developingMessage
source: *** We are in the developing phase. Currently only addition(+), subtraction(-), multiplication(x) and division(/) releated equations are available. ***
bn: *** আমরা উন্নয়নশীল পর্যায়ে আছি। বর্তমানে শুধুমাত্র যোগ(+), বিয়োগ(-), গুণ(x) এবং ভাগ(/) সম্পর্কিত সমীকরণ উপলব্ধ। ***

# shortDesc
source: Currently, children are becoming increasingly dependent on digital devices such as smartphones and tablets. They are wasting a lot of time behind various types of games, which is causing harm to their studies. In reality, this small initiative of ours is aimed at solving all these problems. So that children are not adversely affected by the misuse of technology, but rather they can use digital devices in the field of education. The biggest thing is that through our app, children will be able to learn math in their mother tongue, Bangla, which will be even more helpful for them. Because almost every child in this country starts their education in Bangla at the primary level. As a result, by using our app, children will be able to enjoy learning basic math (such as addition, subtraction, multiplication, division) and the scoring format in the game-like format will encourage them to practice more math.
bn: বর্তমানে শিশুরা স্মার্টফোন, ট্যাবলেট ইত্যাদি ডিজিটাল ডিভাইসের প্রতি নির্ভরশীল হয়ে যাচ্ছে। বিভিন্ন ধরণের গেমের প্রতি আকৃষ্ট হয়ে এর পিছনে প্রচুর সময় নষ্ট করছে। ফলে তাদের পড়াশোনায়ও ক্ষতি হচ্ছে। প্রকৃতপক্ষে এই সবকিছুর সমস্যার সমাধানের জন্যই আমাদের এই ক্ষুদ্র প্রাথমিক প্রচেষ্টা। যেন প্রযুক্তির অপব্যবহারের কারণে শিশুরা ক্ষতিগ্রস্থ না হয়, বরং তারা যেন ডিজিটাল ডিভাইসগুলোকে শিক্ষাক্ষেত্রে ব্যবহার করতে পারে। সবচেয়ে বড় কথা আমাদের এপের মাধ্যমে শিশুরা মাতৃভাষা বাংলায় গণিত শিখতে পারবে যা তাদের জন্য আরোও সহজ সহায়ক হবে। কারণ এদেশের প্রায় প্রতিটি শিশুই প্রাথমিকভাবে বাংলায় শিক্ষাজীবন শুরু করে। ফলে আমাদের এপটি ব্যবহার করে শিশুরা আনন্দের সাথে প্রাথমিক গণিত শিক্ষা (যেমন যোগ, বিয়োগ, গুণ, ভাগ) গ্রহণ করতে পারবে এবং এতে গেমের মত স্করিং ফরমেট থাকায় শিশুদের বেশি বেশি গণিত অনুশীলন করতে উৎসাহিত করবে।
